app/controllers/school_classes_controller.rb

    def update
        @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Gym Kana"], ["room_number", 100], ["updated_at", "2018-09-25 16:47:53.695464"], ["id", 2]]