app/controllers/students_controller.rb

    def create
        @student = Student.create(students_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-09-25 16:52:12.416092"], ["updated_at", "2018-09-25 16:52:12.416092"]]

    def update

        @student.update(students_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-09-25 16:52:12.977997"], ["id", 1]]